MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX170F512L.atdf
         <register caption="" name="CNSTATF" offset="0x590" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATF" />
            <bitfield mask="0x00000002" name="CNSTATF" />
            <bitfield mask="0x00000004" name="CNSTATF" />
            <bitfield mask="0x00000008" name="CNSTATF" />
            <bitfield mask="0x00000010" name="CNSTATF" />
            <bitfield mask="0x00000020" name="CNSTATF" />
            <bitfield mask="0x00000040" name="CNSTATF" />
            <bitfield mask="0x00000080" name="CNSTATF" />
            <bitfield mask="0x00000100" name="CNSTATF" />
            <bitfield mask="0x00000200" name="CNSTATF" />
            <bitfield mask="0x00000400" name="CNSTATF" />
            <bitfield mask="0x00000800" name="CNSTATF" />
            <bitfield mask="0x00001000" name="CNSTATF" />
            <bitfield mask="0x00002000" name="CNSTATF" />
            <bitfield mask="0x00004000" name="CNSTATF" />
            <bitfield mask="0x00008000" name="CNSTATF" />
         </register>
         <register caption="" name="CNSTATG" offset="0x690" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATG" />
            <bitfield mask="0x00000002" name="CNSTATG" />
            <bitfield mask="0x00000004" name="CNSTATG" />
            <bitfield mask="0x00000008" name="CNSTATG" />
            <bitfield mask="0x00000010" name="CNSTATG" />
            <bitfield mask="0x00000020" name="CNSTATG" />
            <bitfield mask="0x00000040" name="CNSTATG" />
            <bitfield mask="0x00000080" name="CNSTATG" />
            <bitfield mask="0x00000100" name="CNSTATG" />
            <bitfield mask="0x00000200" name="CNSTATG" />
            <bitfield mask="0x00000400" name="CNSTATG" />
            <bitfield mask="0x00000800" name="CNSTATG" />
            <bitfield mask="0x00001000" name="CNSTATG" />
            <bitfield mask="0x00002000" name="CNSTATG" />
            <bitfield mask="0x00004000" name="CNSTATG" />
            <bitfield mask="0x00008000" name="CNSTATG" />
         </register>
      </register-group>
   </module>
   <module caption="" id="02028" name="RCON" version="4">
      <register-group name="RCON">
         <register caption="Reset Control Register" name="RCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Power-on Reset Flag bit" mask="0x00000001" name="POR" values="RCON__POR" />
            <bitfield caption="Brown-out Reset Flag bit" mask="0x00000002" name="BOR" values="RCON__BOR" />
            <bitfield caption="Wake From Idle Flag bit" mask="0x00000004" name="IDLE" values="RCON__IDLE" />
            <bitfield caption="Wake From Sleep Flag bit" mask="0x00000008" name="SLEEP" values="RCON__SLEEP" />
            <bitfield caption="Watchdog Timer Time-out Flag bit" mask="0x00000010" name="WDTO" values="RCON__WDTO" />
            <bitfield caption="Software Reset Flag bit" mask="0x00000040" name="SWR" values="RCON__SWR" />
            <bitfield caption="External Reset Pin Flag bit" mask="0x00000080" name="EXTR" values="RCON__EXTR" />
            <bitfield caption="Voltage Regulator Standby Enable bit" mask="0x00000100" name="VREGS" values="RCON__VREGS" />
            <bitfield caption="Configuration Mismatch Reset Flag bit" mask="0x00000200" name="CMR" values="RCON__CMR" />
            <bitfield caption="High Voltage Detect Reset Flag bit" mask="0x20000000" name="HVDR" values="RCON__HVDR" />
         </register>
         <register caption="Software Reset Register" name="RSWRST" offset="0x10" rw="RW" size="4">
            <bitfield caption="Software Reset Trigger bit" mask="0x00000001" name="SWRST" values="RSWRST__SWRST" />
         </register>
      </register-group>
      <value-group caption="Power-on Reset Flag bit" name="RCON__POR">
         <value caption="Power-on Reset has occurred" name="" value="0x1" />
         <value caption="Power-on Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Brown-out Reset Flag bit" name="RCON__BOR">
         <value caption="Brown-out Reset has occurred" name="" value="0x1" />
         <value caption="Brown-out Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Wake From Idle Flag bit" name="RCON__IDLE">
         <value caption="Device was in Idle mode" name="" value="0x1" />
         <value caption="Device was not in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Wake From Sleep Flag bit" name="RCON__SLEEP">
         <value caption="Device was in Sleep mode" name="" value="0x1" />
         <value caption="Device was not in Sleep mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Time-out Flag bit" name="RCON__WDTO">
         <value caption="WDT Time-out has occurred" name="" value="0x1" />
         <value caption="WDT Time-out has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Software Reset Flag bit" name="RCON__SWR">
         <value caption="Software Reset was executed" name="" value="0x1" />
         <value caption="Software Reset as not executed" name="" value="0x0" />
      </value-group>
      <value-group caption="External Reset Pin Flag bit" name="RCON__EXTR">
         <value caption="Master Clear (pin) Reset has occurred" name="" value="0x1" />
         <value caption="Master Clear (pin) Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Voltage Regulator Standby Enable bit" name="RCON__VREGS">
         <value caption="Regulator is enabled and is on during Sleep mode" name="" value="0x1" />
         <value caption="Regulator is set to Stand-by Tracking mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Configuration Mismatch Reset Flag bit" name="RCON__CMR">
         <value caption="Configuration mismatch Reset has occurred" name="" value="0x1" />
         <value caption="Configuration mismatch Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="High Voltage Detect Reset Flag bit" name="RCON__HVDR">
         <value caption="High Voltage Detect (HVD) Reset has occurred" name="" value="0x1" />
         <value caption="HVD Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Software Reset Trigger bit" name="RSWRST__SWRST">
         <value caption="Enable software Reset event" name="" value="0x1" />
         <value caption="No effect" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02495" name="RPIN" version="">
      <register-group name="RPIN">
         <register caption="Peripheral Pin Select Input Register" name="INT1R" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="INT1R" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="INT2R" offset="0x4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="INT2R" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="INT3R" offset="0x8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="INT3R" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="INT4R" offset="0xc" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="INT4R" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="T2CKR" offset="0x14" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="T2CKR" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="T3CKR" offset="0x18" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="T3CKR" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="T4CKR" offset="0x1c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="T4CKR" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="T5CKR" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="T5CKR" />
         </register>
